In [2]:
import pandas as pd
import numpy as np
import plotly.graph_objs as go
import os

In [8]:
df = pd.read_csv('names-all-years.csv')

Empty DataFrame
Columns: [Unnamed: 0, Name, Gender, n, Year]
Index: []

In [11]:
df.drop('Unnamed: 0', axis=1, inplace=True)
df.head()

    Name Gender    n  Year
0  Aaron      M  102  1880
1  Aaron      M   94  1881
2  Aaron      M   85  1882
3  Aaron      M  105  1883
4  Aaron      M   97  1884

In [33]:
boysDf = df[(df.Year >= 2000) & (df.Year <= 2016) & (df.Gender == 'M')].groupby(['Name', 'Gender'])[['n']].sum().sort_values(["n"], ascending=False).iloc[:10,]

boysDf
# filteredDF <- filter(df, Year >= 2000 & Year <= 2016 & Gender == "M") %>% 
#        group_by(Name, Gender) %>% 
#        summarise(total = sum(n)) %>% 
#        arrange(desc(total)) %>%
#        top_n((10))

                         n
Name        Gender
Jacob       M       400578
Michael     M       360013
Joshua      M       315248
Matthew     M       315179
Ethan       M       314794
William     M       310448
Daniel      M       303484
Andrew      M       284683
Alexander   M       284486
Christopher M       282340